# Python3 (3.4.3)
import sys
input = sys.stdin.readline

# -------------------------------------------------------------
# function
# -------------------------------------------------------------


# -------------------------------------------------------------
# main
# -------------------------------------------------------------
N = int(input())
V = list(map(int,input().split()))

# v1 : 0,2,4... 番目の要素からなるリスト
# v2 : 1,3,5... 番目の要素からなるリスト
v1 = V[0::2]
v2 = V[1::2]

# それぞれ, 要素の出現回数を集計する.
# 一番出現回数が多い数字 以外 を書き換えるのが良さそう
from collections import Counter
c1 = Counter(v1).most_common()
c2 = Counter(v2).most_common()

# 数字が1つしかない場合に"2番目"をダミーで追加
c1.append((0,0))
c2.append((0,0))

# 残したい数字が v1,v2 で一致した場合, どちらかは次点を採用せざるを得ない
if c1[0][0]==c2[0][0]:
    print(min(N-(c1[0][1]+c2[1][1]), N-(c1[1][1]+c2[0][1])))
else:
    print(N- (c1[0][1]+c2[0][1]))
