# Python3 (3.4.3)
import sys
input = sys.stdin.readline

# -------------------------------------------------------------
# function
# -------------------------------------------------------------


# -------------------------------------------------------------
# main
# -------------------------------------------------------------
N,K = map(int,input().split())

# K が 1回出た場合 : Kより大きい数, Kより小さい数 が 1回ずつ. 順番は6通り
K1 = (K-1)*(N-K)*6
# K が 2回出た場合 : 残りはなんでも中央値はK だが, Kが出ると3回になるので -1. 順番は3通り
K2 = (N-1)*3
# K が 3回出た場合 : 中央値は K 
K3 = 1

print((K1+K2+K3)/(N**3))