# python 3.4.3
import sys
input = sys.stdin.readline
import numpy as np

# -------------------------------------------------------------
# function
# -------------------------------------------------------------


# -------------------------------------------------------------
# main
# -------------------------------------------------------------
S = input().rstrip()

N = len(S)
ans0 = 0 # S[0]==0 とする場合 : 偶数0 奇数1に
ans1 = 0 # S[0]==1 とする場合 : 偶数1 奇数0に

for i in range(N):
    if i%2==0:
        if S[i]=="0":
            ans1 += 1
        else:
            ans0 += 1
    else:
        if S[i]=="0":
            ans0 += 1
        else:
            ans1 += 1

print(min(ans0,ans1))
