# Python3 (3.4.3)
import sys
input = sys.stdin.readline

# -------------------------------------------------------------
# function
# -------------------------------------------------------------


# -------------------------------------------------------------
# main
# -------------------------------------------------------------
A,B = map(int,input().split())

# 100x100 で 上半分を".", 下半分を"#"で塗る
X = []
for i in range(100):
    if i<50:
        X.append(["."]*100)
    else:
        X.append(["#"]*100)

# 白
A = A-1 # 上半分が白なので, 白は既に1連結成分ある
# 下半分の黒エリアについて, 4x4 のうち1マスを必要な分だけ白で塗っていく
q,r = A//50, A%50
for i in range(q):
    for j in range(50):
        X[99-i*2][j*2] = "."
for i in range(r):
    X[51][i*2] = "."

# 黒
B = B-1 # 下半分が黒なので, 黒は既に1連結成分ある
# 上半分の白エリアについて, 4x4 のうち1マスを必要な分だけ黒で塗っていく
q,r = B//50, B%50
for i in range(q):
    for j in range(50):
        X[i*2][j*2] = "#"
for i in range(r):
    X[48][i*2] = "#"

print(100,100)
for x in X:
    print("".join(x))
