# python 3.4.3
import sys
input = sys.stdin.readline

# -------------------------------------------------------------
# library
# -------------------------------------------------------------



# -------------------------------------------------------------
# main
# -------------------------------------------------------------
N = int(input())
A = list(map(int,input().split()))

# 負の要素数を数える、ついでに負の要素を正にしておく(絶対値最小を後で使うかもしれないので)
cnt = 0
for i in range(N):
    if A[i] < 0:
        cnt += 1
        A[i] *= -1

A.sort()

# 負の数が偶数個なら、全部正にできる
if cnt%2==0:
    print(sum(A))
# 負の数が奇数個なら、一番絶対値が小さい要素を負にするのが最善
else:
    print(sum(A)- A[0]*2)