# Python3 (3.4.3)
import sys
input = sys.stdin.readline

# -------------------------------------------------------------
# function
# -------------------------------------------------------------


# -------------------------------------------------------------
# main
# -------------------------------------------------------------
N,K = map(int,input().split())
S = input().rstrip()

# 隣あう2人の向きが同じ をカウントする
cnt = 0
for i in range(N-1):
    if S[i]==S[i+1]:
        cnt += 1

# 1回の反転で +2 される => 最大で 2K 増える
cnt += 2*K

# ただし 最大値は 全員が同じ向きを向いた場合の N-1
print(min(N-1,cnt))