# Python3 (3.4.3)
import sys
input = sys.stdin.readline

# -------------------------------------------------------------
# function
# -------------------------------------------------------------


# -------------------------------------------------------------
# main
# -------------------------------------------------------------
N = int(input())
H = list(map(int,input().split()))

ans = "Yes"
# 左端は1下げてもデメリットはないので下げておく
H[0] -= 1
for i in range(N-1):
    if H[i] > H[i+1]:
        ans = "No"
        break
    elif H[i] < H[i+1]:
        H[i+1] -= 1

print(ans)